{
    "report_day_start": "16",
    "report_month_start": "February",
    "report_year_start": "2024",
    "report_day_end": "23",
    "report_month_end": "February",
    "report_year_end": "2024",
    "report_end_date": "2024_02_23",
    "report_current_date": "24_02_2024",
    "report_title": "Big Hat Group Weekly Security Update Report",
    "report_subtitle": "(Windows and Edge Edition)",
    "report_description": "The Weekly Security Update Report is provided by Big Hat Group with the goal of making it easier to find the information System Administrators and Security Professionals need to keep their systems secure. The CVE Weekly Report is provided as a beta resource.",
    "plot_path": "../plots/",
    "toc": {
        "section_1": "MSRC Posts",
        "section_2": "Products",
        "section_3": "Tooling Support"
    },
    "section_1_data": [
        {
            "id": "0c6e162a-8b2c-75d6-f946-58664ecd6050",
            "post_id": "CVE-2023-36019",
            "published": "16-02-2024",
            "revision": "1.2",
            "post_type": "Information only",
            "title": "CVE-2023-36019 Microsoft Power Platform Connector Spoofing Vulnerability",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-36019",
            "summary": "Microsoft Power Platform Connector is impacted by a critical spoofing vulnerability, CVE-2023-36019, with a CVSS score of 9.6. The vulnerability allows an attacker to manipulate a malicious link, application, or file to disguise it as legitimate, tricking the victim. It requires user interaction, where the user must click on a specially crafted URL to be compromised. Successful exploitation could lead to a scope change, with malicious scripts executing in the victim’s browser. Microsoft has provided a mitigation by requiring custom connectors using OAuth 2.0 to use a per-connector redirect URI, with a deadline of March 29, 2024. After this date, users will no longer be able to create connections to or use existing OAuth 2.0 custom connectors that have not been updated. Affected customers were notified via the Microsoft 365 Admin Center and Service Health in the Azure Portal. System administrators are advised to validate and update their custom connectors to mitigate the risk of exploitation.",
            "related_posts": "[]",
            "build_number_str": [],
            "kb_article_pairs": [],
            "package_pairs": [],
            "core_products": []
        },
        {
            "id": "ba930fad-3758-26e9-5daa-9bd2ca7284b7",
            "post_id": "CVE-2024-21315",
            "published": "20-02-2024",
            "revision": "1.0",
            "post_type": "Information only",
            "title": "CVE-2024-21315 Microsoft Defender for Endpoint Protection Elevation of Privilege Vulnerability",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-21315",
            "summary": "Microsoft Defender for Endpoint Protection is affected by an elevation of privilege vulnerability identified as CVE-2024-21315, with a CVSS score of 7.8. The vulnerability allows an attacker to gain SYSTEM privileges. It was addressed by updates released in November 2023, but inadvertently omitted from the November 2023 Security Updates. Microsoft strongly recommends installing the November 2023 updates to mitigate this vulnerability. Various Windows versions and editions, including Windows Server and Windows 10, are impacted. Security updates with build numbers 5032202, 5032189, 5032190, 5034819, 5032197, 5034830, and others are available to address this issue. The impact of exploitation includes high confidentiality, integrity, and availability risks. The attack vector is local, with low attack complexity and privileges required. No user interaction is needed for exploitation. A complete vendor solution is available, and no exploit code is currently available, making exploitation less likely. System administrators are strongly advised to install the recommended updates to protect affected systems from this elevation of privilege vulnerability.",
            "related_posts": "[]",
            "build_number_str": [],
            "kb_article_pairs": [],
            "package_pairs": [],
            "core_products": []
        },
        {
            "id": "b1f9aa62-9c95-ff4e-d62f-61edc68c700c",
            "post_id": "CVE-2024-26192",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "CVE-2024-26192 Microsoft Edge (Chromium-based) Information Disclosure Vulnerability",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-26192",
            "summary": "Microsoft Edge (Chromium-based) is impacted by an Information Disclosure Vulnerability, assigned as CVE-2024-26192, with a CVSS score of 8.2. The vulnerability could lead to a browser sandbox escape and requires user interaction to be exploited. An attacker could host a specially crafted website to convince a user to view it, potentially compromising the user by clicking on a specially crafted URL. Successful exploitation could result in some loss of availability, causing performance interruptions. Microsoft has released a security update for Microsoft Edge (Chromium-based) with build number 122.0.2365.52, addressing this vulnerability. System administrators are advised to apply the security update to mitigate the risk of exploitation. For further details, refer to the Microsoft Security Response Center page.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        },
        {
            "id": "c9afb5fa-103b-54a4-f749-79d347784d06",
            "post_id": "CVE-2024-26188",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Information only",
            "title": "CVE-2024-26188 Microsoft Edge (Chromium-based) Spoofing Vulnerability",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-26188",
            "summary": "Microsoft Edge (Chromium-based) is affected by a low severity spoofing vulnerability, identified as CVE-2024-26188. The vulnerability requires user interaction, where the user needs to click on a specially crafted URL to be compromised by the attacker. Successful exploitation could lead to some loss of integrity, allowing the attacker to cover and spoof elements of the UI, with the modified information being only visual. The vulnerability has a low attack complexity and does not require any privileges or specialized access conditions. Microsoft has released a security update for Microsoft Edge (Chromium-based) with the build number 122.0.2365.52 to address this vulnerability. System administrators are advised to update their Microsoft Edge installations to the latest version to mitigate the risk of exploitation. For more information, refer to the Microsoft Security Response Center page.",
            "related_posts": "[]",
            "build_number_str": [],
            "kb_article_pairs": [],
            "package_pairs": [],
            "core_products": []
        },
        {
            "id": "81130d3b-7a9c-d043-63be-767339d30288",
            "post_id": "CVE-2024-21423",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "CVE-2024-21423 Microsoft Edge (Chromium-based) Information Disclosure Vulnerability",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-21423",
            "summary": "Microsoft Edge (Chromium-based) is impacted by an Information Disclosure Vulnerability identified as CVE-2024-21423. The vulnerability has a low severity with a CVSS score of 4.8/4.2. It is caused by a flaw that allows limited information disclosure, with no sensitive information being obtainable. Successful exploitation of this vulnerability requires high attack complexity and no user interaction. An attacker could exploit this vulnerability remotely without any privileges, impacting the confidentiality and integrity of the system. Microsoft has provided a security update for Microsoft Edge (Chromium-based) with the build number 122.0.2365.52 to address this vulnerability. System administrators are advised to apply this update to mitigate the risk of information disclosure. For further details, refer to the Microsoft Support Lifecycle page.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        },
        {
            "id": "fb470399-6f69-3e0b-7202-71c666081627",
            "post_id": "CVE-2024-21307",
            "published": "23-02-2024",
            "revision": "2.1",
            "post_type": "Information only",
            "title": "CVE-2024-21307 Remote Desktop Client Remote Code Execution Vulnerability",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-21307",
            "summary": "The CVE-2024-21307 vulnerability affects the Remote Desktop client for Windows Desktop, Windows Server, and various Windows versions, leading to remote code execution. The vulnerability has a base score of 7.5 and a temporal score of 6.5, indicating high severity. It is remotely exploitable, requires no privileges, and demands user interaction. Successful exploitation could result in total loss of confidentiality, integrity, and availability. Microsoft has provided a security update for the affected products, with build numbers ranging from 1.2.5105.0 to 10.0.14393.6614. System administrators are advised to ensure that the mentioned versions or higher are installed to mitigate the risk of exploitation. The attack complexity is high, requiring an attacker to win a race condition, and an unauthorized attacker must wait for a user to initiate a connection. This is an informational change only, with no substantive updates beyond the previous revision.",
            "related_posts": "[]",
            "build_number_str": [],
            "kb_article_pairs": [
                {
                    "kb_id": "kb5034134",
                    "kb_link": "https://support.microsoft.com/help/5034134#january-09-2024"
                },
                {
                    "kb_id": "kb5034123",
                    "kb_link": "https://support.microsoft.com/help/5034123#january-09-2024"
                },
                {
                    "kb_id": "kb5034122",
                    "kb_link": "https://support.microsoft.com/help/5034122#january-09-2024"
                },
                {
                    "kb_id": "kb5034121",
                    "kb_link": "https://support.microsoft.com/help/5034121#january-09-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update (KB5034134)",
                    "package_url": "https://catalog.update.microsoft.com/v7/site/Search.aspx?q=KB5034134"
                },
                {
                    "package_type": "Security Update (KB5034123)",
                    "package_url": "https://catalog.update.microsoft.com/v7/site/Search.aspx?q=KB5034123"
                },
                {
                    "package_type": "Security Update (KB5034122)",
                    "package_url": "https://catalog.update.microsoft.com/v7/site/Search.aspx?q=KB5034122"
                },
                {
                    "package_type": "Security Update (KB5034121)",
                    "package_url": "https://catalog.update.microsoft.com/v7/site/Search.aspx?q=KB5034121"
                }
            ],
            "core_products": []
        },
        {
            "id": "eb6d8df7-4877-a25c-13b4-f84066849667",
            "post_id": "CVE-2024-20677",
            "published": "23-02-2024",
            "revision": "2.1",
            "post_type": "Information only",
            "title": "CVE-2024-20677 Microsoft Office Remote Code Execution Vulnerability",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-20677",
            "summary": "A remote code execution vulnerability, CVE-2024-20677, affects Microsoft Office, including Office 2019, Office 2021, Office LTSC for Mac 2021, and Microsoft 365. The vulnerability exists in FBX, leading to remote code execution, and has a CVSS base score of 7.8. The attack vector is local, requiring user interaction, and successful exploitation could result in total loss of confidentiality, integrity, and availability. To mitigate this, the ability to insert FBX files has been disabled in Word, Excel, PowerPoint, Outlook, and 3D Viewer. The change is effective as of the January 9, 2024 security update. Microsoft has provided security updates for affected products, and affected customers can get the update from the Microsoft Store or through their organizations. Additionally, PowerShell command 'Get-AppxPackage -Name Microsoft.Microsoft3DViewer' can be used to check if the update is installed. The security update for Microsoft Office 2021 for Mac is not immediately available, and affected customers will be notified when it is released.",
            "related_posts": "[]",
            "build_number_str": [],
            "kb_article_pairs": [],
            "package_pairs": [],
            "core_products": []
        },
        {
            "id": "cc447771-31dc-8e78-644d-857df9a7134f",
            "post_id": "CVE-2024-1676",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "Chromium: CVE-2024-1676 Inappropriate implementation in Navigation",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-1676",
            "summary": "Microsoft Edge (Chromium-based) is affected by CVE-2024-1676, an inappropriate implementation vulnerability in Navigation. This vulnerability, assigned by Chrome, is addressed by ingesting Chromium, and the latest version of Microsoft Edge (Chromium-based) is no longer vulnerable. The vulnerability is caused by an inappropriate implementation in the Navigation feature. An attacker could exploit this vulnerability to execute arbitrary code in the context of the current user. Microsoft has provided a solution by releasing a security update for Microsoft Edge (Chromium-based) with the build number 122.0.2365.52. System administrators are advised to update their Microsoft Edge installations to the latest version to mitigate the risk of exploitation. For more information, refer to the [Google Chrome Releases](https://chromereleases.googleblog.com/2024) page.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        },
        {
            "id": "069f63f6-493e-e69c-4a49-c630f0ee09d6",
            "post_id": "CVE-2024-1675",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "Chromium: CVE-2024-1675 Insufficient policy enforcement in Download",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-1675",
            "summary": "Microsoft Edge (Chromium-based) is affected by CVE-2024-1675, an Insufficient policy enforcement vulnerability in the Download feature. This vulnerability was assigned by Chrome and is addressed by ingesting Chromium. The latest version of Microsoft Edge (Chromium-based) with build number 122.0.2365.52 is no longer vulnerable. The vulnerability is caused by a flaw in the Chromium Open Source Software (OSS) consumed by Microsoft Edge. An attacker could exploit this vulnerability to execute arbitrary code. Microsoft has provided a solution by releasing a security update for Microsoft Edge (Chromium-based) with the build number 122.0.2365.52. System administrators are advised to update their Microsoft Edge installations to the latest version to mitigate the risk of exploitation. For more information, refer to the Google Chrome Releases page.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        },
        {
            "id": "9bbbb693-312c-b174-1e8d-8a885d05b059",
            "post_id": "CVE-2024-1674",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "Chromium: CVE-2024-1674 Inappropriate implementation in Navigation",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-1674",
            "summary": "Microsoft Edge (Chromium-based) is affected by CVE-2024-1674, an inappropriate implementation vulnerability in Navigation, assigned by Chrome. This vulnerability is in the Chromium Open Source Software (OSS) consumed by Microsoft Edge. An attacker could exploit this vulnerability to execute arbitrary code in the context of the current user. Microsoft has addressed this vulnerability by ingesting Chromium, and the latest version of Microsoft Edge (Chromium-based) is no longer vulnerable. System administrators are advised to update their Microsoft Edge installations to the latest version. For more information, refer to the Google Chrome Releases page. The latest stable version of Microsoft Edge (Chromium-based) is 122.0.2365.52, released on 23-02-2024. Microsoft recognizes the efforts of the security community in coordinated vulnerability disclosure. There are no explicit workarounds or mitigations provided for this vulnerability.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        },
        {
            "id": "ae10fdfe-1015-f1bd-2215-d0386c2ef587",
            "post_id": "CVE-2024-1673",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "Chromium: CVE-2024-1673 Use after free in Accessibility",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-1673",
            "summary": "Microsoft Edge (Chromium-based) is affected by a use after free vulnerability in Accessibility, identified as CVE-2024-1673. This vulnerability was assigned by Chrome and is addressed by ingesting Chromium. The latest version of Microsoft Edge (Chromium-based) with build number 122.0.2365.52 is no longer vulnerable. The vulnerability is caused by a flaw in the Chromium Open Source Software (OSS) consumed by Microsoft Edge. An attacker could exploit this vulnerability to execute arbitrary code in the context of the current user. Microsoft has provided a solution by releasing a security update for Microsoft Edge (Chromium-based) with the mentioned build number. System administrators are advised to update their Microsoft Edge installations to the latest version to mitigate the risk of exploitation. More information can be found on the [Google Chrome Releases](https://chromereleases.googleblog.com/2024) page.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        },
        {
            "id": "cc7c922d-41ab-5c6b-c3b5-2b9c010ebfc6",
            "post_id": "CVE-2024-1672",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "Chromium: CVE-2024-1672 Inappropriate implementation in Content Security Policy",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-1672",
            "summary": "Microsoft Edge (Chromium-based) is affected by CVE-2024-1672, an inappropriate implementation in Content Security Policy. This vulnerability was assigned by Chrome and is addressed by ingesting Chromium. The latest version of Microsoft Edge (Chromium-based) with build number 122.0.2365.52 is no longer vulnerable. The vulnerability is caused by an inappropriate implementation in Content Security Policy, which could be exploited by an attacker to execute arbitrary code in the context of the current user. Microsoft has provided a solution by releasing a security update for Microsoft Edge (Chromium-based) with the build number 122.0.2365.52. System administrators are advised to update their Microsoft Edge installations to the latest version to mitigate the risk of exploitation. For more information, refer to the [Google Chrome Releases](https://chromereleases.googleblog.com/2024) page.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        },
        {
            "id": "200b1e46-0a00-8f72-0c72-329854c60040",
            "post_id": "CVE-2024-1671",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "Chromium: CVE-2024-1671 Inappropriate implementation in Site Isolation",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-1671",
            "summary": "Microsoft Edge (Chromium-based) is affected by CVE-2024-1671, an inappropriate implementation in Site Isolation, assigned by Chrome. This vulnerability is in the Chromium Open Source Software (OSS) consumed by Microsoft Edge. An attacker could exploit this vulnerability to execute arbitrary code in the context of the current user. Microsoft has addressed this vulnerability by ingesting Chromium, and the latest version of Microsoft Edge (Chromium-based) is no longer vulnerable. System administrators are advised to update Microsoft Edge to the latest version, such as build number 122.0.2365.52, to mitigate the risk of exploitation. For more information, refer to the Google Chrome Releases page.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        },
        {
            "id": "f100b0ef-9591-e4ac-100e-3a1b8b7fcf68",
            "post_id": "CVE-2024-1670",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "Chromium: CVE-2024-1670 Use after free in Mojo",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-1670",
            "summary": "Microsoft Edge (Chromium-based) is affected by a use after free vulnerability in Mojo, identified as CVE-2024-1670. This vulnerability was assigned by Chrome and is addressed by ingesting Chromium. The latest version of Microsoft Edge (Chromium-based) with build number 122.0.2365.52 is no longer vulnerable. The vulnerability is caused by a flaw in the Chromium Open Source Software (OSS) consumed by Microsoft Edge. An attacker could exploit this vulnerability to execute arbitrary code in the context of the current user. Microsoft has provided a solution by releasing a security update for Microsoft Edge (Chromium-based) with the build number 122.0.2365.52. System administrators are advised to update their Microsoft Edge installations to the latest version to mitigate the risk of exploitation. For more information, refer to the [Google Chrome Releases](https://chromereleases.googleblog.com/2024) page.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        },
        {
            "id": "a848b7aa-ac6a-07d0-107c-a68429d0e55e",
            "post_id": "CVE-2024-1669",
            "published": "23-02-2024",
            "revision": "1.0",
            "post_type": "Solution provided",
            "title": "Chromium: CVE-2024-1669 Out of bounds memory access in Blink",
            "source": "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2024-1669",
            "summary": "Microsoft Edge (Chromium-based) is affected by a new out of bounds memory access vulnerability in Blink, identified as CVE-2024-1669. This vulnerability was assigned by Chrome and is addressed by ingesting Chromium. The latest version of Microsoft Edge (Chromium-based) with build number 122.0.2365.52 is no longer vulnerable. The vulnerability is caused by a flaw in the Chromium Open Source Software (OSS) consumed by Microsoft Edge. An attacker could exploit this vulnerability to execute arbitrary code in the context of the current user. Microsoft has provided a solution by releasing a security update for Microsoft Edge (Chromium-based) with the build number 122.0.2365.52. System administrators are advised to update their Microsoft Edge installations to the latest version to mitigate the risk of exploitation. For more information, refer to the [Google Chrome Releases](https://chromereleases.googleblog.com/2024) page.",
            "related_posts": "[]",
            "build_number_str": [
                "122.0.2365.52"
            ],
            "kb_article_pairs": [
                {
                    "kb_id": "Release Note (23-02-2024)",
                    "kb_link": "https://docs.microsoft.com/en-us/DeployEdge/microsoft-edge-relnotes-security#february-23-2024"
                }
            ],
            "package_pairs": [
                {
                    "package_type": "Security Update",
                    "package_url": "#"
                }
            ],
            "core_products": [
                "microsoft edge (chromium-based)  "
            ]
        }
    ],
    "section_1_metadata": {
        "total_cves": 15,
        "new_cves": 12,
        "updated_cves": 3
    },
    "section_2_data": [],
    "section_2_metadata": {
        "total_products": 0
    },
    "section_3_data": [],
    "section_3_metadata": {
        "total_tools": 0
    }
}